parsing-tech-log/src/InformationRegisters/СостояниеЧтения/СостояниеЧтения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеЧтения</name>
  <resources>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧтениеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрочитаноСтрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаИзмененияСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПрочитанныхДанных</name>
    <comment>Дата последней прочитанной записи из источника</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ФайлЗамера</name>
    <type>
      <types>CatalogRef.ФайлыЗамера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

parsing-tech-log/src/InformationRegisters/СостояниеЧтения/ManagerModule.bsl
Функция ПолучитьСостояние(ЗНАЧ ФайлЗамера) Экспорт
	Результат = Новый Структура("ПрочитаноСтрок,ЧтениеЗавершено,Размер,ДатаИзмененияСостояния,ДатаПрочитанныхДанных", 0, Ложь, 0, Дата(1,1,1), Дата(1,1,1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СостояниеЧтения.Размер КАК Размер,
	|	СостояниеЧтения.ЧтениеЗавершено КАК ЧтениеЗавершено,
	|	СостояниеЧтения.ПрочитаноСтрок КАК ПрочитаноСтрок,
	|	СостояниеЧтения.ДатаИзмененияСостояния КАК ДатаИзмененияСостояния,
	|	СостояниеЧтения.ДатаПрочитанныхДанных КАК ДатаПрочитанныхДанных
	|ИЗ
	|	РегистрСведений.СостояниеЧтения КАК СостояниеЧтения
	|ГДЕ
	|	СостояниеЧтения.ФайлЗамера = &ФайлЗамера";
	Запрос.УстановитьПараметр("ФайлЗамера", ФайлЗамера);
	РезультатЗапроса = Запрос.Выполнить(); 
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса.Выгрузить()[0]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьСостояние(
		ФайлЗамера, 
		ПериодФайла,
		ПрочитаноСтрок, 
		ДатаНачалаЧтения,
		РазмерФайла,
		ДатаПрочитанныхДанных=Неопределено) Экспорт
		
	//если дата начала чтения больше чем конец часа (запас в 5 минут) 
	//считаем что файл больше дополняться не будет
	ЧтениеЗавершено = ДатаНачалаЧтения > КонецЧаса(ПериодФайла) + 300;
	
	ТекущееСостояние = ПолучитьСостояние(ФайлЗамера);
	Если ТекущееСостояние.ПрочитаноСтрок = ПрочитаноСтрок
		И ТекущееСостояние.ЧтениеЗавершено = ЧтениеЗавершено Тогда
		Возврат;
	КонецЕсли;	
	
	МенеджерЗаписи = РегистрыСведений.СостояниеЧтения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ФайлЗамера 				= ФайлЗамера;
	МенеджерЗаписи.ПрочитаноСтрок 			= ПрочитаноСтрок;
	МенеджерЗаписи.ЧтениеЗавершено 			= ЧтениеЗавершено;
	МенеджерЗаписи.Размер 					= РазмерФайла;
	МенеджерЗаписи.ДатаИзмененияСостояния 	= ТекущаяДата();
	МенеджерЗаписи.ДатаПрочитанныхДанных 	= ДатаПрочитанныхДанных;
	МенеджерЗаписи.Записать();		
		
	
КонецПроцедуры
